# Вычислить число c заданной точностью d

# Пример:

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
# =======================================================================================

from decimal import Decimal, getcontext
# from math import pi

n  = input('Введите вещественное число: ')
 #'3.1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679'
acc = input('Задайте точность в формате "0.000001": ')
#'0.0000000000000000000000001'

getcontext().prec = 99 # повысим точность для "длинных" значений

dec_prec = str(Decimal(acc)*10**(len(acc)-2)) # преобразование строки точности к виду, требуемому для quantize

print('Округленное число: '+str(Decimal(n).quantize(Decimal(dec_prec))))

